Autodesk.Revit.DB.Analysis.HVACLoadType.OutdoorAirFlowStandard
The outdoor airflow standard.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.AirChangesPerHour
The air changes per hour.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,10000].
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.OutdoorAirPerArea
The outdoor air per area.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,166.66].
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.OutdoorAirPerPerson
The outdoor air per person.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,166.66].
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.PlenumLighting
The percentage of plenum lighting contribution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,1.0].
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.PowerLoadDensity
The power load density.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,500000.0].
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.LightingLoadDensity
The lighting load density.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,500000.0].
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.LatentHeatGainPerPerson
The latent heat gain per person.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,5381.9].
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.SensibleHeatGainPerPerson
The sensible heat gain per person.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,5381.9].
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.AreaPerPerson
The area per person.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for value must be non-negative.
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType
The base class for building type and space type.
Since:
2018